spec/fixtures/vcr_cassettes/SolidusKlarnaPayments_SessionsController/_create/with_an_empty_session_id/raises_an_exception.yml

---
http_interactions:
- request:
    method: post
    uri: https://api-na.playground.klarna.com/payments/v1/sessions/
    body:
      encoding: UTF-8
      string: '{"purchase_country":"US","purchase_currency":"USD","locale":"en-US","order_amount":11000,"billing_address":{"email":"email1@example.com","organization_name":"Company","given_name":"John","family_name":"Von
        Doe","street_address":"PO Box 1337","street_address2":"Northwest","postal_code":"10001","city":"Herndon","region":"AL","phone":"555-555-0199","country":"US"},"shipping_address":{"email":"email1@example.com","organization_name":"Company","given_name":"John","family_name":"Von
        Doe","street_address":"A Different Road","street_address2":"Northwest","postal_code":"10002","city":"Herndon","region":"AL","phone":"555-555-0199","country":"US"},"order_lines":[{"reference":"SKU-1","name":"Product
        #1 - 7522","quantity":1,"unit_price":1000,"tax_rate":0,"total_amount":1000,"total_tax_amount":0,"image_url":null,"product_url":"http://www.example1.com/products/1"},{"type":"shipping_fee","reference":"H06728740731","name":"UPS
        Ground","quantity":1,"unit_price":10000,"total_amount":10000,"total_tax_amount":0,"tax_rate":0}],"merchant_reference1":"R588965898","options":{},"merchant_urls":{"confirmation":"http://www.example1.com/orders/R588965898","notification":"http://www.example1.com/solidus_klarna_payments/callbacks/notification"},"order_tax_amount":0}'
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby Klarna 0.9.2 (Klarna Solidus Gateway/0.1.1 Solidus/3.2.0.alpha Rails/6.1.4.1
        Ruby/2.7.3)
      Content-Type:
      - application/json
      Authorization:
      - Basic VUcxMDAyMTlfY2VhMDNjNDgxYWM3OnBDZmxJWENsdjJJbWVNeEs=
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 16 Sep 2021 14:33:32 GMT
      Content-Type:
      - application/json;charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Server:
      - openresty
      Vary:
      - Accept-Encoding
      Klarna-Correlation-Id:
      - 9f6693f2-1b2e-4307-a9ca-657ad6e8ea94
      Render-Time:
      - '29'
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      X-Frame-Options:
      - DENY
      X-Envoy-Upstream-Service-Time:
      - '29'
    body:
      encoding: ASCII-8BIT
      string: |-
        {
          "session_id" : "b8bd9f1b-ee9f-3cf8-ae5f-8438a23e4496",
          "client_token" : "eyJhbGciOiJSUzI1NiIsImtpZCI6IjgyMzA1ZWJjLWI4MTEtMzYzNy1hYTRjLTY2ZWNhMTg3NGYzZCJ9.eyJzZXNzaW9uX2lkIjoiYjhiZDlmMWItZWU5Zi0zY2Y4LWFlNWYtODQzOGEyM2U0NDk2IiwiYmFzZV91cmwiOiJodHRwczovL2pzLnBsYXlncm91bmQua2xhcm5hLmNvbS9uYS9rcCIsImRlc2lnbiI6ImtsYXJuYSIsImxhbmd1YWdlIjoiZW4iLCJwdXJjaGFzZV9jb3VudHJ5IjoiVVMiLCJlbnZpcm9ubWVudCI6InBsYXlncm91bmQiLCJtZXJjaGFudF9uYW1lIjoiTmVidWxhYiIsInNlc3Npb25fdHlwZSI6IlBBWU1FTlRTIiwiY2xpZW50X2V2ZW50X2Jhc2VfdXJsIjoiaHR0cHM6Ly9uYS5wbGF5Z3JvdW5kLmtsYXJuYWV2dC5jb20iLCJzY2hlbWUiOnRydWUsImV4cGVyaW1lbnRzIjpbeyJuYW1lIjoiaW4tYXBwLXNkay1jYXJkLXNjYW5uaW5nIiwidmFyaWF0ZSI6ImNhcmQtc2Nhbm5pbmctZW5hYmxlIiwicGFyYW1ldGVycyI6eyJ2YXJpYXRlX2lkIjoiY2FyZC1zY2FubmluZy1lbmFibGUifX1dLCJyZWdpb24iOiJ1cyIsInVhX2VuYWJsZWRfYW5kX29uZV9wbSI6dHJ1ZX0.TH3TvfMYIfAZpiH3Wo1qAkzGZ3kGj4onodTPQNco2WXCOJ3g2NzcBC1iCjkZhGpCvRa6w6Cwj2okr-hy_acbMuMiKkxTjMQWf7zwTXHxv_cEtaOtPChC_FeDZwgSf6X6ZSAMRmfZEyMO9N-NQw5Ks4ih2TNtyGt3YLPtiY4lsHfdLbtIZ9K0fq7GXgx_-zhK7S3edU__pZgpswrHWZ9n0LTa4G_d-pRAxgatois5VEd3I-dJkYZJMXhdGX3oyPQLA4LUG1Z9nCO1UenLBe-upD1OZ02pK0yNdmGSdtlB2sfgzDjNZt54qwFe3g9ZetR7A3Otaizw8fUPC1oNTAJPNg",
          "payment_method_categories" : [ {
            "identifier" : "pay_over_time",
            "name" : "4 interest-free payments",
            "asset_urls" : {
              "descriptive" : "https://x.klarnacdn.net/payment-method/assets/badges/generic/klarna.svg",
              "standard" : "https://x.klarnacdn.net/payment-method/assets/badges/generic/klarna.svg"
            }
          } ]
        }
  recorded_at: Thu, 16 Sep 2021 14:33:32 GMT
recorded_with: VCR 6.0.0
